app/controllers/products_controller.rb

  def data
    @products = Product.all
---
SELECT "products".* FROM "products"

   def telephone
    @products = Product.where(category: "Mobile").paginate(:page => params[:page], :per_page => Configurable['products_per_page'])
---
SELECT  "products".* FROM "products" WHERE "products"."category" = ?  ORDER BY "products"."id" ASC LIMIT 1 OFFSET 0  [["category", "Mobile"]]

  def set_product
    begin
      @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 30]]