app/controllers/store_controller.rb

  def index
    @product=Product.first
---
SELECT  "products".* FROM "products"  ORDER BY "products"."id" ASC LIMIT 1