app/views/line_items/_line_item.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 9]]
---

 <% @cart.line_items.each do |line_item| %>